feat: improved documentaion with better charts
